#include <iostream>
#include <Windows.h>
#include <string>
#include <vector>
#include <fstream>
#include <ctime>




std::wstring variations[10] = { //Для работы не надо
    L"И, ДА111адин!адинадин! МЫ — ЕБАНУЛИСЬ СИСЬКЕ111111 СИСЬКЕ111111!111 ",L"МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ1111!!11 ЛУЧИ ПОНОСА!!!!!1111 АДИНАДИН!!11 Я ИДИОТадин11111111111УБЕЙТЕ МЕНЯ КТО–НИБУДЬ1111!!! ПОТСЗОХВАЧЕН1111!!!!!!! ГЛАНДЭадин!!11111111 ГОЛАКТЕКО ОПАСНОСТЕ1адин1111111 адин1111адинадин!1111 ПОТС ЗОХВАЧЕН ЛУЧИ ПОНОСА1111 Я ИДИОТ111111УБЕЙТЕ МЕНЯ КТО–НИБУДЬадин11!11111 ЖАЖА11111адинадин1адин11 ПОПЯЧТС11 !!!!!!!адин ПЕПЯКА УПЯЧКА СЛЕДИТ ЗА ТОБОЙадинадинадин11111!! Медведев — шмель11 ЖЖЖЖЖ111!!!111! 111! ЖАЖАадинадин11 ЪЖЧЛОадинадин УПЯЧКА СЛЕДИТ ЗА ТОБОЙ!11!!!!адин1111 ПОТС ЗОХВАЧЕН111адинадин111! Медведев — шмель ЖЖЖЖЖадинадин111 ПОТС ЗОХВАЧЕН111111111адин И, ДА! МЫ — ЕБАНУЛИСЬ1!!!111111 ЖАЖА!1111!!!! ПЕПЯКА ЖЕПЬ ЕБРИЛО11111 ЪЖЧЛО1111!! ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ!!1",L"ПОТС ЗОХВАЧЕН11!!!!!!!111 Я ИДИОТ111111адин111УБЕЙТЕ МЕНЯ КТО–НИБУДЬ1111111111 Ъеччожа АДИНАДИН111 ОНОТОЛЕЙадин111111111 АДИНАДИНадин1!!!!адин ОЯЕБУадин111!!!!!11 ЛУЧИ ПОНОСА!!!! УпЯЧКА ЖЕПЬ ЕБРИЛО1 ЕБАНИ СТЫД!11111!! Медведев — шмель1!!!1!1 ЖЖЖЖЖ11 ТЕЛОИД11 ЪЖЧЛОадинадинадин ЖАЖА1111 Медведев — шмель!111111 ЖЖЖЖЖадинадинадин111111 ЖЫВТОНЕЧОЧОУПЯЧКА!!!!11 Медведев — шмель!!!!1111111 ЖЖЖЖЖ111111111111 1адинадин11 Медведев—шмельЖЖЖЖЖ!!111 УпЯЧКА ЖАЖА111 ПОПЯЧТС!!!111111! УПЯЧКА СЛЕДИТ ЗА ТОБОЙ!!!!адин1111 ТЕЛОИД1!1!адин СИСЬКЕ!11111111 ПОТС ЗОХВАЧЕН1111111!!!! ЕБАНИ СТЫДадин1111111 УПЯЧКА СЛЕДИТ ЗА ТОБОЙ11адинадин111адин11",L"ОНОТОЛЕЙ11адинадин!!!!! ОЯЕБУ1111 И, ДАадинадинадин!1111111 МЫ — ЕБАНУЛИСЬ1111111! ЪЖСЛО!11111!! ПЕПЯКА ЕБАНИ СТЫД!!адинадин1 СИСЬКЕ!!1адинадин111адинадин! ПЫЩЬ111!!!!!!1ПЫЩЬ111111 ПОПЯЧТС11 !! СВОБОДА РАВЕНСТВО УПЯЧКА11С.Р.У УПЯЧКОЧАТ111!!111!!!1 ПОТС ЗОХВАЧЕН11! ЪЖЧЛОадинадин!! ТЕЛОИД УпЯЧКА ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ!!!!!11111 ЛУЧИ ПОНОСА!1111111 Медведев — шмель1111111адинадин ЖЖЖЖЖ ПыЩЩЩЩЩЩЩЩЩь!!!! ПыЩЩЩЩЩЩЩЩЩь!111111 ПыЩЩЩЩЩЩЩЩЩь1111 АДИНАДИН111111!!адин ПыЩЩЩЩЩЩЩЩЩь!!!111111111 ПыЩЩЩЩЩЩЩЩЩь!1!!!!!! ПыЩЩЩЩЩЩЩЩЩь111111111 АДИНАДИН1!11111 ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ111!11 ТЕЛОИД11 СМОТРИ БАЛЕТ, СУКА Ъеччожа ПыЩЩЩЩЩЩЩЩЩь111111 ПыЩЩЩЩЩЩЩЩЩьадин ПыЩЩЩЩЩЩЩЩЩь111 ГЛАНДЭ!!1111111!!1 И, ДАадинадинадин1111адинадин1 МЫ — ЕБАНУЛИСЬ111111111",L"ТЕЛОИД ЖЕПЬ ЕБРИЛО!1!!! ЛУЧИ ПОНОСА!! Медведев — шмельадин ЖЖЖЖЖадинадинадин1 ПыЩЩЩЩЩЩЩЩЩь111адинадин! ПыЩЩЩЩЩЩЩЩЩь1111111 ПыЩЩЩЩЩЩЩЩЩь111111!адин1111 ЖЕПЬ ЕБРИЛО1111адинадин1 ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ11адинадин!!!1 СМОТРИ БАЛЕТ, СУКА!!!!! ЕБАНИ СТЫД11 И, ДА111 МЫ — ЕБАНУЛИСЬ ПОПЯЧТС!!!!!!!! УПЯЧКОЧАТ!!! ОЯЕБУ!!!!!!!! ЪЖЧЛО1 ПыЩЩЩЩЩЩЩЩЩьадинадинадин1!адинадин!1111 ПыЩЩЩЩЩЩЩЩЩь11 ПыЩЩЩЩЩЩЩЩЩь1адинадин! ПыЩЩЩЩЩЩЩЩЩь!! ПыЩЩЩЩЩЩЩЩЩь111111 ПыЩЩЩЩЩЩЩЩЩь ЖАЖА1111! УпЯЧКА УПЯЧКОЧАТ11111!111111 ЖЫВТОНЕ ЧОЧО УПЯЧКА 1адин111адинадин1!1 СМОТРИ БАЛЕТ, СУКА111 ЛУЧИ ПОНОСА!!11 ТЕЛОИД111 ТЕЛОИД УПЯЧКА СЛЕДИТ ЗА ТОБОЙ11111 ЕБАНИ СТЫД1 ЖАЖА11111111адинадин ПыЩЩЩЩЩЩЩЩЩь111111 ПыЩЩЩЩЩЩЩЩЩь1адинадин!!1 ПыЩЩЩЩЩЩЩЩЩь!!адинадин1111!1 МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ1111111 УПЯЧКА СЛЕДИТ ЗА ТОБОЙ1адин1!!111!111", L"СИСЬКЕадин СВОБОДА РАВЕНСТВО УПЯЧКА!!111!!С.Р.У11111111111 ЖАЖА1 И, ДА111 МЫ — ЕБАНУЛИСЬ!11111111 ЕБАНИСТЫД111111111111 УПЯЧКОЧАТ!адин!11111 ПЫЩЬ11ПЫЩЬ11111 СВОБОДА РАВЕНСТВО УПЯЧКА1адин1!1111С.Р.У1 ОНОТОЛЕЙ111111!1 И, ДА11111 МЫ — ЕБАНУЛИСЬ1111!! ПЕПЯКА ПОПЯЧТС1111 СМОТРИ БАЛЕТ, СУКА11111 СВОБОДА РАВЕНСТВО УПЯЧКА11С.Р.У111 Я ИДИОТУБЕЙТЕ МЕНЯ КТО–НИБУДЬадин11!!1111 И, ДА МЫ — ЕБАНУЛИСЬ!! ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ111111!!!!! !111 ПыЩЩЩЩЩЩЩЩЩь111!1111ПыЩЩЩЩЩЩЩЩЩь111ПыЩЩЩЩЩЩЩЩЩь111111!!!11 ОНОТОЛЕЙ1 ЖАЖА1111!!1адин ЛУЧИ ПОНОСАадин1 СВОБОДА РАВЕНСТВО УПЯЧКА11111!С.Р.У1111адинадин1 ПЫЩЬПЫЩЬадинадинадин11адинадин ТЕЛОИД!111111 ЪЖЧЛОадинадинадин1 ЛУЧИПОНОСА!1111111 ЛУЧИ ПОНОСА11111111 Я ИДИОТ1адин1111УБЕЙТЕ МЕНЯ КТО–НИБУДЬ!!!!!!!111адинадин ПОПЯЧТС11адин111!", L"ТЕЛОИД ПОТС ЗОХВАЧЕН1111111111! УПЯЧКОЧАТ!!!!1111 СМОТРИ БАЛЕТ, СУКА11 Я ИДИОТУБЕЙТЕ МЕНЯ КТО–НИБУДЬ11111 УпЯЧКА ТЕЛОИД111111 УпЯЧКА УпЯЧКА ПЕПЯКА ПыЩЩЩЩЩЩЩЩЩь ПыЩЩЩЩЩЩЩЩЩь1111!!!!!11 ПыЩЩЩЩЩЩЩЩЩь УПЯЧКА СЛЕДИТ ЗА ТОБОЙадин!  ГЛАНДЭ11адинадин11 И,ДАадинадинадин!!!!!!11МЫ—ЕБАНУЛИСЬ1111 ПЫЩЬПЫЩЬ111111111 ЪЖЧЛО11111 ЖАЖА11 И, ДА11111 МЫ — ЕБАНУЛИСЬ!11 И, ДА! МЫ — ЕБАНУЛИСЬадин АДИНАДИН1!!!!! ЖАЖА111!!!!1 СИСЬКЕ1адинадин МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ11111111 И, ДА11! МЫ — ЕБАНУЛИСЬ11!!11111 ПЫЩЬадин111ПЫЩЬ!адин1 ЖЕПЬ ЕБРИЛО11!!!11 СВОБОДА РАВЕНСТВО УПЯЧКА1С.Р.У!!!!!!1", L"ОНОТОЛЕЙадинадин11!!!!! Ъеччожа ПЕПЯКА ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ11 ОНОТОЛЕЙадин111111!адинадин11 УПЯЧКОЧАТ ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ1!!111111111 ЖАЖА!!!11111 ПОПЯЧТС ПЕПЯКА ЪЖЧЛО1111 СМОТРИ БАЛЕТ, СУКА!1! МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ11!!адинадин!!1 ГОЛАКТЕКО ОПАСНОСТЕ11111 ЖЕПЬ ЕБРИЛО111 СВОБОДА РАВЕНСТВО УПЯЧКА1111111!!!11С.Р.У!111 ГОЛАКТЕКО ОПАСНОСТЕ11111111!!!1 МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ111!1 ЕБАНИ СТЫД!11111111111 УПЯЧКА СЛЕДИТ ЗА ТОБОЙ11 ГОЛАКТЕКО ОПАСНОСТЕ!1адин11 ЖАЖА ПОПЯЧТС111111 Медведев — шмельадинадин11111111 ЖЖЖЖЖ111111111111 МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ!!!адинадин11!!111 ЪЖСЛО1адин111адин1111 ТЕЛОИД11!! ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ! УпЯЧКА МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ11адинадин11111111", L"ЖЕПЬ ЕБРИЛО11111адинадин!11 ТЕЛОИД ГОЛАКТЕКО ОПАСНОСТЕ1111111 ЕБАНИ СТЫД111111111 ПЕПЯКА СИСЬКЕ1111 ПыЩЩЩЩЩЩЩЩЩь!11!1 ПыЩЩЩЩЩЩЩЩЩь!111111111 ПыЩЩЩЩЩЩЩЩЩь!11111111111 ТЕЛОИД СВОБОДА РАВЕНСТВО УПЯЧКАадинадин111111С.Р.У1111 ЪЖЧЛО11 УПЯЧКА СЛЕДИТ ЗА ТОБОЙ!1адин1111 УпЯЧКА ГОЛАКТЕКО ОПАСНОСТЕ!!11 ГЛАНДЭ1111111 ПЫЩЬ111111111!ПЫЩЬ!!!!!!11 ЪЖСЛОадинадин!!!111111 ТЕЛОИДадинадин1 ТЕЛОИД Ъеччожа Я ИДИОТадин1111111УБЕЙТЕ МЕНЯ КТО–НИБУДЬ1111адин1111 ПОТС ЗОХВАЧЕН!!1 МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ!!11111 ЭЕКСТЕЛРТЫОЙЯЕБАНЕЙУКОТУ1 ЕБАНИ СТЫД111 ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ!11!1 ЪЖСЛО ЖЕПЬ ЕБРИЛО!11111адинадин11",L"Медведев — шмель ЖЖЖЖЖ11 ОЯЕБУ11111111111 ЛУЧИ ПОНОСА!!!!! ГОЛАКТЕКО ОПАСНОСТЕ11адинадин! УПЯЧКОЧАТ!!адинадин!!!! ЖЕПЬ ЕБРИЛОадинадин УПЯЧКА СЛЕДИТ ЗА ТОБОЙадинадинадин11111111 ЪЖЧЛО!!111адин! ПЫЩЬ1ПЫЩЬ11111111 ГОЛАКТЕКО ОПАСНОСТЕадин ОНОТОЛЕЙ ПЕПЯКА ТЕЛОИД ПЫЩЬ11адинПЫЩЬ1111адинадин111 ЖЫВТОНЕ ЧОЧО УПЯЧКА ТЕЛОИД ОНОТОЛЕЙ1111 УПЯЧКАСЛЕДИТЗАТОБОЙ! АДИНАДИН1 ПЫЩЬ111111!!!ПЫЩЬ!1 УПЯЧКОЧАТ1111 ПОТС ЗОХВАЧЕН11111 СИСЬКЕ ЖЕПЬ ЕБРИЛО111адин ГОЛАКТЕКО ОПАСНОСТЕ111 ТЕЛОИД ОЯЕБУ1111111111 ПОТС ЗОХВАЧЕН!111адинадин111 ГЛАНДЭ!1111111 ЕБАНИ СТЫД!"
};
std::string variations2[10] = { //Для работы не надо
     "И, ДА111адин!адинадин! МЫ — ЕБАНУЛИСЬ СИСЬКЕ111111 СИСЬКЕ111111!111 ", "МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ1111!!11 ЛУЧИ ПОНОСА!!!!!1111 АДИНАДИН!!11 Я ИДИОТадин11111111111УБЕЙТЕ МЕНЯ КТО–НИБУДЬ1111!!! ПОТСЗОХВАЧЕН1111!!!!!!! ГЛАНДЭадин!!11111111 ГОЛАКТЕКО ОПАСНОСТЕ1адин1111111 адин1111адинадин!1111 ПОТС ЗОХВАЧЕН ЛУЧИ ПОНОСА1111 Я ИДИОТ111111УБЕЙТЕ МЕНЯ КТО–НИБУДЬадин11!11111 ЖАЖА11111адинадин1адин11 ПОПЯЧТС11 !!!!!!!адин ПЕПЯКА УПЯЧКА СЛЕДИТ ЗА ТОБОЙадинадинадин11111!! Медведев — шмель11 ЖЖЖЖЖ111!!!111! 111! ЖАЖАадинадин11 ЪЖЧЛОадинадин УПЯЧКА СЛЕДИТ ЗА ТОБОЙ!11!!!!адин1111 ПОТС ЗОХВАЧЕН111адинадин111! Медведев — шмель ЖЖЖЖЖадинадин111 ПОТС ЗОХВАЧЕН111111111адин И, ДА! МЫ — ЕБАНУЛИСЬ1!!!111111 ЖАЖА!1111!!!! ПЕПЯКА ЖЕПЬ ЕБРИЛО11111 ЪЖЧЛО1111!! ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ!!1", "ПОТС ЗОХВАЧЕН11!!!!!!!111 Я ИДИОТ111111адин111УБЕЙТЕ МЕНЯ КТО–НИБУДЬ1111111111 Ъеччожа АДИНАДИН111 ОНОТОЛЕЙадин111111111 АДИНАДИНадин1!!!!адин ОЯЕБУадин111!!!!!11 ЛУЧИ ПОНОСА!!!! УпЯЧКА ЖЕПЬ ЕБРИЛО1 ЕБАНИ СТЫД!11111!! Медведев — шмель1!!!1!1 ЖЖЖЖЖ11 ТЕЛОИД11 ЪЖЧЛОадинадинадин ЖАЖА1111 Медведев — шмель!111111 ЖЖЖЖЖадинадинадин111111 ЖЫВТОНЕЧОЧОУПЯЧКА!!!!11 Медведев — шмель!!!!1111111 ЖЖЖЖЖ111111111111 1адинадин11 Медведев—шмельЖЖЖЖЖ!!111 УпЯЧКА ЖАЖА111 ПОПЯЧТС!!!111111! УПЯЧКА СЛЕДИТ ЗА ТОБОЙ!!!!адин1111 ТЕЛОИД1!1!адин СИСЬКЕ!11111111 ПОТС ЗОХВАЧЕН1111111!!!! ЕБАНИ СТЫДадин1111111 УПЯЧКА СЛЕДИТ ЗА ТОБОЙ11адинадин111адин11", "ОНОТОЛЕЙ11адинадин!!!!! ОЯЕБУ1111 И, ДАадинадинадин!1111111 МЫ — ЕБАНУЛИСЬ1111111! ЪЖСЛО!11111!! ПЕПЯКА ЕБАНИ СТЫД!!адинадин1 СИСЬКЕ!!1адинадин111адинадин! ПЫЩЬ111!!!!!!1ПЫЩЬ111111 ПОПЯЧТС11 !! СВОБОДА РАВЕНСТВО УПЯЧКА11С.Р.У УПЯЧКОЧАТ111!!111!!!1 ПОТС ЗОХВАЧЕН11! ЪЖЧЛОадинадин!! ТЕЛОИД УпЯЧКА ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ!!!!!11111 ЛУЧИ ПОНОСА!1111111 Медведев — шмель1111111адинадин ЖЖЖЖЖ ПыЩЩЩЩЩЩЩЩЩь!!!! ПыЩЩЩЩЩЩЩЩЩь!111111 ПыЩЩЩЩЩЩЩЩЩь1111 АДИНАДИН111111!!адин ПыЩЩЩЩЩЩЩЩЩь!!!111111111 ПыЩЩЩЩЩЩЩЩЩь!1!!!!!! ПыЩЩЩЩЩЩЩЩЩь111111111 АДИНАДИН1!11111 ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ111!11 ТЕЛОИД11 СМОТРИ БАЛЕТ, СУКА Ъеччожа ПыЩЩЩЩЩЩЩЩЩь111111 ПыЩЩЩЩЩЩЩЩЩьадин ПыЩЩЩЩЩЩЩЩЩь111 ГЛАНДЭ!!1111111!!1 И, ДАадинадинадин1111адинадин1 МЫ — ЕБАНУЛИСЬ111111111", "ТЕЛОИД ЖЕПЬ ЕБРИЛО!1!!! ЛУЧИ ПОНОСА!! Медведев — шмельадин ЖЖЖЖЖадинадинадин1 ПыЩЩЩЩЩЩЩЩЩь111адинадин! ПыЩЩЩЩЩЩЩЩЩь1111111 ПыЩЩЩЩЩЩЩЩЩь111111!адин1111 ЖЕПЬ ЕБРИЛО1111адинадин1 ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ11адинадин!!!1 СМОТРИ БАЛЕТ, СУКА!!!!! ЕБАНИ СТЫД11 И, ДА111 МЫ — ЕБАНУЛИСЬ ПОПЯЧТС!!!!!!!! УПЯЧКОЧАТ!!! ОЯЕБУ!!!!!!!! ЪЖЧЛО1 ПыЩЩЩЩЩЩЩЩЩьадинадинадин1!адинадин!1111 ПыЩЩЩЩЩЩЩЩЩь11 ПыЩЩЩЩЩЩЩЩЩь1адинадин! ПыЩЩЩЩЩЩЩЩЩь!! ПыЩЩЩЩЩЩЩЩЩь111111 ПыЩЩЩЩЩЩЩЩЩь ЖАЖА1111! УпЯЧКА УПЯЧКОЧАТ11111!111111 ЖЫВТОНЕ ЧОЧО УПЯЧКА 1адин111адинадин1!1 СМОТРИ БАЛЕТ, СУКА111 ЛУЧИ ПОНОСА!!11 ТЕЛОИД111 ТЕЛОИД УПЯЧКА СЛЕДИТ ЗА ТОБОЙ11111 ЕБАНИ СТЫД1 ЖАЖА11111111адинадин ПыЩЩЩЩЩЩЩЩЩь111111 ПыЩЩЩЩЩЩЩЩЩь1адинадин!!1 ПыЩЩЩЩЩЩЩЩЩь!!адинадин1111!1 МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ1111111 УПЯЧКА СЛЕДИТ ЗА ТОБОЙ1адин1!!111!111",  "СИСЬКЕадин СВОБОДА РАВЕНСТВО УПЯЧКА!!111!!С.Р.У11111111111 ЖАЖА1 И, ДА111 МЫ — ЕБАНУЛИСЬ!11111111 ЕБАНИСТЫД111111111111 УПЯЧКОЧАТ!адин!11111 ПЫЩЬ11ПЫЩЬ11111 СВОБОДА РАВЕНСТВО УПЯЧКА1адин1!1111С.Р.У1 ОНОТОЛЕЙ111111!1 И, ДА11111 МЫ — ЕБАНУЛИСЬ1111!! ПЕПЯКА ПОПЯЧТС1111 СМОТРИ БАЛЕТ, СУКА11111 СВОБОДА РАВЕНСТВО УПЯЧКА11С.Р.У111 Я ИДИОТУБЕЙТЕ МЕНЯ КТО–НИБУДЬадин11!!1111 И, ДА МЫ — ЕБАНУЛИСЬ!! ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ111111!!!!! !111 ПыЩЩЩЩЩЩЩЩЩь111!1111ПыЩЩЩЩЩЩЩЩЩь111ПыЩЩЩЩЩЩЩЩЩь111111!!!11 ОНОТОЛЕЙ1 ЖАЖА1111!!1адин ЛУЧИ ПОНОСАадин1 СВОБОДА РАВЕНСТВО УПЯЧКА11111!С.Р.У1111адинадин1 ПЫЩЬПЫЩЬадинадинадин11адинадин ТЕЛОИД!111111 ЪЖЧЛОадинадинадин1 ЛУЧИПОНОСА!1111111 ЛУЧИ ПОНОСА11111111 Я ИДИОТ1адин1111УБЕЙТЕ МЕНЯ КТО–НИБУДЬ!!!!!!!111адинадин ПОПЯЧТС11адин111!",  "ТЕЛОИД ПОТС ЗОХВАЧЕН1111111111! УПЯЧКОЧАТ!!!!1111 СМОТРИ БАЛЕТ, СУКА11 Я ИДИОТУБЕЙТЕ МЕНЯ КТО–НИБУДЬ11111 УпЯЧКА ТЕЛОИД111111 УпЯЧКА УпЯЧКА ПЕПЯКА ПыЩЩЩЩЩЩЩЩЩь ПыЩЩЩЩЩЩЩЩЩь1111!!!!!11 ПыЩЩЩЩЩЩЩЩЩь УПЯЧКА СЛЕДИТ ЗА ТОБОЙадин!  ГЛАНДЭ11адинадин11 И,ДАадинадинадин!!!!!!11МЫ—ЕБАНУЛИСЬ1111 ПЫЩЬПЫЩЬ111111111 ЪЖЧЛО11111 ЖАЖА11 И, ДА11111 МЫ — ЕБАНУЛИСЬ!11 И, ДА! МЫ — ЕБАНУЛИСЬадин АДИНАДИН1!!!!! ЖАЖА111!!!!1 СИСЬКЕ1адинадин МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ11111111 И, ДА11! МЫ — ЕБАНУЛИСЬ11!!11111 ПЫЩЬадин111ПЫЩЬ!адин1 ЖЕПЬ ЕБРИЛО11!!!11 СВОБОДА РАВЕНСТВО УПЯЧКА1С.Р.У!!!!!!1",  "ОНОТОЛЕЙадинадин11!!!!! Ъеччожа ПЕПЯКА ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ11 ОНОТОЛЕЙадин111111!адинадин11 УПЯЧКОЧАТ ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ1!!111111111 ЖАЖА!!!11111 ПОПЯЧТС ПЕПЯКА ЪЖЧЛО1111 СМОТРИ БАЛЕТ, СУКА!1! МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ11!!адинадин!!1 ГОЛАКТЕКО ОПАСНОСТЕ11111 ЖЕПЬ ЕБРИЛО111 СВОБОДА РАВЕНСТВО УПЯЧКА1111111!!!11С.Р.У!111 ГОЛАКТЕКО ОПАСНОСТЕ11111111!!!1 МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ111!1 ЕБАНИ СТЫД!11111111111 УПЯЧКА СЛЕДИТ ЗА ТОБОЙ11 ГОЛАКТЕКО ОПАСНОСТЕ!1адин11 ЖАЖА ПОПЯЧТС111111 Медведев — шмельадинадин11111111 ЖЖЖЖЖ111111111111 МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ!!!адинадин11!!111 ЪЖСЛО1адин111адин1111 ТЕЛОИД11!! ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ! УпЯЧКА МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ11адинадин11111111",  "ЖЕПЬ ЕБРИЛО11111адинадин!11 ТЕЛОИД ГОЛАКТЕКО ОПАСНОСТЕ1111111 ЕБАНИ СТЫД111111111 ПЕПЯКА СИСЬКЕ1111 ПыЩЩЩЩЩЩЩЩЩь!11!1 ПыЩЩЩЩЩЩЩЩЩь!111111111 ПыЩЩЩЩЩЩЩЩЩь!11111111111 ТЕЛОИД СВОБОДА РАВЕНСТВО УПЯЧКАадинадин111111С.Р.У1111 ЪЖЧЛО11 УПЯЧКА СЛЕДИТ ЗА ТОБОЙ!1адин1111 УпЯЧКА ГОЛАКТЕКО ОПАСНОСТЕ!!11 ГЛАНДЭ1111111 ПЫЩЬ111111111!ПЫЩЬ!!!!!!11 ЪЖСЛОадинадин!!!111111 ТЕЛОИДадинадин1 ТЕЛОИД Ъеччожа Я ИДИОТадин1111111УБЕЙТЕ МЕНЯ КТО–НИБУДЬ1111адин1111 ПОТС ЗОХВАЧЕН!!1 МЖВЯЧНИ ПРДУНЬ–ПРДУНЬ!!11111 ЭЕКСТЕЛРТЫОЙЯЕБАНЕЙУКОТУ1 ЕБАНИ СТЫД111 ЭЕКСТЕЛР ТЫОЙ ЯЕБАНЕЙУ КОТУ!11!1 ЪЖСЛО ЖЕПЬ ЕБРИЛО!11111адинадин11", "Медведев — шмель ЖЖЖЖЖ11 ОЯЕБУ11111111111 ЛУЧИ ПОНОСА!!!!! ГОЛАКТЕКО ОПАСНОСТЕ11адинадин! УПЯЧКОЧАТ!!адинадин!!!! ЖЕПЬ ЕБРИЛОадинадин УПЯЧКА СЛЕДИТ ЗА ТОБОЙадинадинадин11111111 ЪЖЧЛО!!111адин! ПЫЩЬ1ПЫЩЬ11111111 ГОЛАКТЕКО ОПАСНОСТЕадин ОНОТОЛЕЙ ПЕПЯКА ТЕЛОИД ПЫЩЬ11адинПЫЩЬ1111адинадин111 ЖЫВТОНЕ ЧОЧО УПЯЧКА ТЕЛОИД ОНОТОЛЕЙ1111 УПЯЧКАСЛЕДИТЗАТОБОЙ! АДИНАДИН1 ПЫЩЬ111111!!!ПЫЩЬ!1 УПЯЧКОЧАТ1111 ПОТС ЗОХВАЧЕН11111 СИСЬКЕ ЖЕПЬ ЕБРИЛО111адин ГОЛАКТЕКО ОПАСНОСТЕ111 ТЕЛОИД ОЯЕБУ1111111111 ПОТС ЗОХВАЧЕН!111адинадин111 ГЛАНДЭ!1111111 ЕБАНИ СТЫД!"
};
std::string config = "config.txt"; //Путь к файду конфига
const unsigned short int STRL = 1280; //Максимальная длина сообщения

struct settings { 
    int decayDelay = 5000;
    int buttonDelay = 5;
    bool autosend = false;
    int minDelay = 2500;
    int maxDelay = 5000;
    int paramsRequired = 5; // Сколько строк отдается под конфиг
    bool isConfigFound = false;
};

void echo(std::string data, int marker = 0) { //Для работы не надо
    if (marker == 111) std::cout << "[OK] ";
    if (marker == 666) std::cout << "[ERROR] ";
    std::cout << data << "\n";
}

int rnd(int border, bool isSigned) { //Генерация случайного числа, если флаг фолс, от 0 до border, если истина, от border отрицательного, до положительного
    if(isSigned) return (-border + rand() % (2 * border + 1));
    else return (rand() % (border + 1));
}

void SendKey(const char * ret, bool autosend, int delay) { //Отправляет сторку

    INPUT pInput;
    wchar_t wc;
    //wsprintf(ret, "ТестСообщения");

    for (int i = 0; i < strlen(ret); i++) {
        MultiByteToWideChar(CP_ACP, MB_PRECOMPOSED, ret + i, 1, &wc, 1);
        pInput.type = INPUT_KEYBOARD;
        pInput.ki.wVk = 0;
        pInput.ki.time = 10;
        pInput.ki.wScan = wc;
        pInput.ki.dwFlags = KEYEVENTF_UNICODE;
        SendInput(1, &pInput, sizeof(pInput));
        pInput.ki.dwFlags = KEYEVENTF_UNICODE | KEYEVENTF_KEYUP;
        SendInput(1, &pInput, sizeof(pInput));
        Sleep(delay);
    }
    if (autosend) {
        keybd_event(0x0D, 0, 0, 0);
        keybd_event(0x0D, 0, KEYEVENTF_KEYUP, 0);
    }
}

int getCountOfLines(const char* Filename) {
    int tmp = 0;
    std::ifstream File(Filename);
    std::string currentStr;
    if (File.fail()) {
        std::cout << "[ERROR] config can't be loaded, please check if " << config.c_str() << "file exists in program folder\n";
    }
    else {
        while (getline(File, currentStr)) {
            tmp++;
        }
    }
    File.close();
    return tmp;
}
bool loadConfig(const char* Filename, settings* Settings, std::string * variations, int variationsNum) {
    std::ifstream File(Filename);
    std::string currentStr;
    bool result = true;
    if (File.fail()) {
        std::cout << "[ERROR] config can't be loaded, please check if " << config.c_str() << "file exists in program folder\n";
        result = false;
    }
    else {
        getline(File, currentStr);
        Settings->decayDelay = atoi(currentStr.c_str());
        getline(File, currentStr);
        Settings->buttonDelay = atoi(currentStr.c_str());
        getline(File, currentStr);
        Settings->autosend = atoi(currentStr.c_str());
        getline(File, currentStr);
        Settings->minDelay = atoi(currentStr.c_str());
        getline(File, currentStr);
        Settings->maxDelay = atoi(currentStr.c_str());
        for (int i = 0; i < variationsNum; i++) {
            getline(File, currentStr);
            variations[i] = currentStr;
        }
    }
    File.close();
    return result;
}

int main()
{
    srand(time(NULL));
    setlocale(LC_ALL, "Russian");
    settings Settings;
    int variationsNumber = getCountOfLines(config.c_str()) - Settings.paramsRequired;
    if (variationsNumber) {
        std::cout << "[OK] Config was found with " << variationsNumber << " variations\n"; Settings.isConfigFound = true;
    }
    else std::cout << "[ERROR] Config was damaged or it is not exists. Process terminated!\n";
    std::string* variations3 = new std::string[variationsNumber];
    if (Settings.isConfigFound) {
        if (loadConfig(config.c_str(), &Settings, variations3, variationsNumber)) {
            Settings.isConfigFound = true;
            std::cout << "[OK] Config was loaded\n";
        }
        else {
            Settings.isConfigFound = false;
            std::cout << "[ERROR] Config damaged. Process Terminated!\n";
        }
    }
    if (Settings.isConfigFound) {
        std::cout << "[INFO] There are such lines in config\n\n";
        for (int i = 0; i < variationsNumber; i++) {
            std::cout << variations3[i] << "\n";
        }
    }
    if (Settings.isConfigFound) {
        std::cout << "[INFO] FIRE IN THE ASS!!!\n";
        Sleep(Settings.decayDelay);
        while (1) {
            int var = rnd(variationsNumber-1, 0);
            std::cout << "[INFO] Sending " << var << " " << variations3[var].c_str() << "\n";
            SendKey(variations3[var].c_str(), Settings.autosend, Settings.buttonDelay);
            Sleep(rnd(Settings.maxDelay - Settings.minDelay, 0) + Settings.minDelay);
        }
    }
    return 0;
}
